tap "armmbed/formulae"
tap "benbjohnson/litestream"
tap "filosottile/musl-cross"
tap "heroku/brew"
tap "homebrew/services"
tap "mongodb/brew"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "tdewolff/tap"
tap "tinygo-org/tools"
brew "xz"
brew "openssl@3"
brew "arduino-cli"
brew "libusb"
brew "avrdude"
brew "ncurses"
brew "bash"
brew "btop"
brew "caddy"
brew "cmake"
brew "cmake-docs"
brew "gcc"
brew "sqlite"
brew "composer"
brew "coreutils"
brew "cpanminus"
brew "direnv"
brew "doctl"
brew "epr"
brew "exercism"
brew "fd"
brew "fdupes"
brew "fzf"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "gnu-typist"
brew "gnupg"
brew "go"
brew "golang-migrate"
brew "graphviz"
brew "haproxy"
brew "hey"
brew "htop"
brew "httpie"
brew "hugo"
brew "jq"
brew "julia"
brew "less"
brew "linode-cli"
brew "luarocks"
brew "make"
brew "mas"
brew "mysql"
brew "n"
brew "ncdu"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "openjdk"
brew "qrencode"
brew "tree"
brew "pass"
brew "perl"
brew "pidof"
brew "pkgconf"
brew "postgresql@15", restart_service: :changed
brew "protobuf"
brew "python@3.9"
brew "ranger"
brew "rclone"
brew "redis"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "rustup"
brew "sqlfluff"
brew "sqlite-analyzer"
brew "stylua"
brew "subversion"
brew "telnet"
brew "tldr"
brew "tmux"
brew "tokei"
brew "vegeta"
brew "wasm-pack"
brew "wget"
brew "woff2"
brew "zplug"
brew "zsh"
brew "armmbed/formulae/arm-none-eabi-gcc"
brew "benbjohnson/litestream/litestream"
brew "filosottile/musl-cross/musl-cross"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-community"
brew "osx-cross/avr/avr-gcc@9"
brew "tdewolff/tap/minify"
brew "tinygo-org/tools/tinygo"
cask "alacritty"
cask "anki"
cask "beekeeper-studio"
cask "bitwig-studio"
cask "blender"
cask "calibre"
cask "darktable"
cask "docker-desktop"
cask "figma"
cask "firefox"
cask "font-cascadia-code-nf"
cask "font-charter"
cask "font-consolas-for-powerline"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-medium-and-semi-bold"
cask "font-courier-prime-sans"
cask "font-cousine-nerd-font"
cask "font-dm-mono"
cask "font-dm-sans"
cask "font-dm-serif-text"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-ibm-plex-mono"
cask "font-inconsolata"
cask "font-inter"
cask "font-jetbrains-mono-nerd-font"
cask "font-lato"
cask "font-noto-mono"
cask "font-noto-nerd-font"
cask "font-noto-sans-mono"
cask "font-open-sans"
cask "font-pt-mono"
cask "font-pt-sans"
cask "font-pt-serif"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-roboto-slab"
cask "gcloud-cli"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "inkscape"
cask "karabiner-elements"
cask "multipatch"
cask "obsidian"
cask "pika"
cask "qbittorrent"
cask "raspberry-pi-imager"
cask "readest"
cask "reaper"
cask "rectangle"
cask "shearwater-cloud"
cask "standard-notes"
cask "tinypng4mac"
mas "iMovie", id: 408981434
mas "Logic Pro", id: 634148309
mas "Todoist", id: 585829637
go "github.com/spf13/cobra-cli"
go "golang.org/x/tools/cmd/goimports"
go "github.com/fatih/gomodifytags"
go "golang.org/x/telemetry/cmd/gotelemetry"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "github.com/skip2/go-qrcode/qrcode"
go "github.com/cespare/reflex"
go "github.com/jackc/tern/v2"
go "github.com/caddyserver/xcaddy/cmd/xcaddy"
