tap "armmbed/formulae"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "tinygo-org/tools"
brew "xz"
brew "arduino-cli"
brew "libusb"
brew "avrdude"
brew "bash"
brew "bat"
brew "pkg-config"
brew "cmake"
brew "cmake-docs"
brew "sqlite"
brew "composer"
brew "coreutils"
brew "deno"
brew "doctl"
brew "exercism"
brew "fd"
brew "gcc"
brew "git"
brew "gnu-sed"
brew "go"
brew "golang-migrate"
brew "graphviz"
brew "haproxy"
brew "hey"
brew "ncurses"
brew "htop"
brew "httpie"
brew "hugo"
brew "julia"
brew "less"
brew "luarocks"
brew "make"
brew "mas"
brew "mysql", restart_service: true
brew "n"
brew "ncdu"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "openjdk"
brew "pidof"
brew "postgresql@15", restart_service: true
brew "protobuf"
brew "python@3.9"
brew "ranger"
brew "redis"
brew "ren"
brew "ripgrep"
brew "rustfmt"
brew "rustup-init"
brew "siege"
brew "stylua"
brew "subversion"
brew "telnet"
brew "tldr"
brew "tmux"
brew "tree"
brew "wasm-pack"
brew "wget"
brew "zplug"
brew "zsh"
brew "armmbed/formulae/arm-none-eabi-gcc"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-community"
brew "osx-cross/avr/avr-gcc@9"
brew "oven-sh/bun/bun"
brew "tinygo-org/tools/tinygo"
cask "alacritty"
cask "anki"
cask "beekeeper-studio"
cask "blender"
cask "docker"
cask "firefox"
cask "font-consolas-for-powerline"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-medium-and-semi-bold"
cask "font-courier-prime-sans"
cask "font-dm-mono"
cask "font-dm-sans"
cask "font-dm-serif-text"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-ibm-plex-mono"
cask "font-inconsolata"
cask "font-lato"
cask "font-noto-mono"
cask "font-noto-nerd-font"
cask "font-open-sans"
cask "font-pt-mono"
cask "font-pt-sans"
cask "font-pt-serif"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-roboto-slab"
cask "google-chrome"
cask "google-drive"
cask "karabiner-elements"
cask "pika"
cask "qbittorrent"
cask "raspberry-pi-imager"
cask "rectangle"
cask "skype"
mas "Kindle", id: 302584613
mas "Logic Pro", id: 634148309
mas "Todoist", id: 585829637
